[
    {
      "name": "Солом'яний чоловік",
      "description": "Перекручування аргументу опонента, щоб його було легше спростувати.",
      "example": "Особа А: Ми повинні покращити шкільні обіди. Особа Б: Мій опонент хоче заборонити всі перекуси.",
      "correctedExample": "Особа Б: Я згоден, що нам потрібні кращі шкільні обіди. Давайте обговоримо, як їх покращити, зберігаючи деякі варіанти перекусів.",
      "explanation": "Особа Б перекрутила аргумент Особа А у щось крайнє та легше для критики."
    },
    {
      "name": "Ad Hominem",
      "description": "Атака на особу замість її аргументу.",
      "example": "Не слухайте її ідеї щодо зміни клімату — вона навіть не вчений.",
      "correctedExample": "Її освіта може бути не науковою, але ми все одно можемо оцінити її аргумент сам по собі.",
      "explanation": "Оратор ігнорує справжній аргумент і атакує особу замість цього."
    },
    {
      "name": "Заклик до популярності",
      "description": "Ствердження, що щось є правдою лише тому, що багато людей у це вірять.",
      "example": "Усі кажуть, що ця дієта працює, отже, вона найкраща.",
      "correctedExample": "Ми повинні звернутися до наукових досліджень, щоб дізнатися, чи ефективна ця дієта.",
      "explanation": "Популярність не гарантує правдивості чи ефективності."
    },
    {
      "name": "Хибна дилема",
      "description": "Представлення лише двох варіантів, коли існує більше.",
      "example": "Ви або з нами, або проти нас.",
      "correctedExample": "Ви можете підтримувати частини нашої ідеї, не погоджуючись з усім.",
      "explanation": "Це несправедливо обмежує складні ситуації лише двома виборами."
    },
    {
      "name": "Слизький схил",
      "description": "Ствердження, що один маленький крок призведе до жахливого результату.",
      "example": "Якщо ми дозволимо дітям вибирати вечерю, незабаром вони прийматимуть усі рішення вдома.",
      "correctedExample": "Дозвіл дітям вибирати вечерю не означає, що вони контролюватимуть усе інше.",
      "explanation": "Аргумент перебільшує наслідки без доказів."
    },
    {
      "name": "Кругова аргументація",
      "description": "Використання висновку як передумови.",
      "example": "Мені можна довіряти, тому що я завжди кажу правду.",
      "correctedExample": "Ви можете довіряти мені, тому що я завжди був чесним у минулих ситуаціях.",
      "explanation": "Аргументація йде по колу, не пропонуючи реальних доказів."
    },
    {
      "name": "Поспішне узагальнення",
      "description": "Зроблення широкого твердження на основі малої кількості доказів.",
      "example": "Я зустрів двох грубих туристів з тієї країни — усі звідти мають бути грубими.",
      "correctedExample": "Несправедливо судити про всю країну на основі двох людей.",
      "explanation": "Аргумент узагальнює з дуже маленької вибірки."
    },
    {
      "name": "Post Hoc",
      "description": "Припущення, що одна подія спричинила іншу лише тому, що вона сталася першою.",
      "example": "Я одягнув свої щасливі шкарпетки, і ми виграли — це точно через шкарпетки!",
      "correctedExample": "Перемога, ймовірно, була завдяки майстерності, а не моїм шкарпеткам.",
      "explanation": "Кореляція не означає причинно-наслідковий зв'язок."
    },
    {
      "name": "Заклик до емоцій",
      "description": "Використання емоцій замість фактів для аргументації.",
      "example": "Якщо ви не пожертвуєте, ці цуценята страждатимуть.",
      "correctedExample": "Ваша пожертва допомагає тваринам отримати догляд. Ось як це працює.",
      "explanation": "Аргумент намагається переконати за допомогою почуття провини замість причин."
    },
    {
      "name": "Червоний оселедець",
      "description": "Введення чогось несуттєвого, щоб відволікти від теми.",
      "example": "Навіщо турбуватися про забруднення, якщо ми ще не вирішили проблему бідності?",
      "correctedExample": "Ми можемо піклуватися і про забруднення, і про бідність. Давайте обговоримо це питання зараз.",
      "explanation": "Оратор змінює тему, щоб уникнути початкового питання."
    }
]