[
  {
    "name": "Атака на особу (Ad Hominem)",
    "description": "Відхилення ідеї через критику особи, а не самої ідеї.",
    "example": "Не можна довіряти думці Марії щодо зміни клімату — вона провалила науку в школі.",
    "correctedExample": "Оцінки Марії в минулому не мають значення. Давайте розглянемо дані, які вона надає щодо зміни клімату.",
    "explanation": "Аргумент відхиляє точку зору Марії через її особисту історію, а не по суті питання."
  },
  {
    "name": "Спотворення аргументу (Солом'яний опудало)",
    "description": "Зміна чи спрощення аргументу, щоб легше було його спростувати.",
    "example": "Іван каже, що треба обережніше ставитися до військових витрат. Олена відповідає: 'Іван хоче залишити нас беззахисними!'",
    "correctedExample": "Іван пропонує обережність, а не скасування армії. Треба обговорювати його справжню думку.",
    "explanation": "Олена перекручує думку Івана, роблячи її надмірною та не пов’язаною з темою."
  },
  {
    "name": "Це правда, бо всі так вважають (Звернення до популярності)",
    "description": "Ствердження, що щось є правдою лише тому, що багато людей так думають.",
    "example": "Всі кажуть, що ця дієта працює, отже, вона ефективна.",
    "correctedExample": "Треба перевірити, чи є наукові докази ефективності цієї дієти.",
    "explanation": "Популярність не доводить істинності."
  },
  {
    "name": "Тільки два варіанти (Помилкова дилема)",
    "description": "Ствердження, що існує лише два варіанти, хоча їх більше.",
    "example": "Ти або з нами, або проти нас.",
    "correctedExample": "Можна підтримувати деякі ідеї, не погоджуючись з усім.",
    "explanation": "Це спрощує складні позиції до двох крайнощів."
  },
  {
    "name": "Ходіння по колу (Питання, що просить доказу)",
    "description": "Повторення висновку як причини без доказів.",
    "example": "Закон справедливий, бо це закон.",
    "correctedExample": "Треба пояснити, чому закон є справедливим або корисним.",
    "explanation": "Припускається те, що потрібно довести."
  },
  {
    "name": "Якщо це, то катастрофа (Слизький схил)",
    "description": "Ствердження, що невеликий крок призведе до крайності без доказів.",
    "example": "Якщо дозволити учням переробляти завдання, вони захочуть перездавати всі тести.",
    "correctedExample": "Дозвіл переробляти деякі завдання не означає скасування всіх правил. Треба обговорити саму політику.",
    "explanation": "Від невеликої зміни переходять до перебільшеного результату."
  },
  {
    "name": "Поспішні висновки (Поспішна генералізація)",
    "description": "Загальне твердження на основі недостатньої кількості доказів.",
    "example": "Я зустрів двох грубих людей з того міста — всі там грубі.",
    "correctedExample": "Двох людей недостатньо, щоб судити про все місто.",
    "explanation": "Виводиться загальне правило з кількох випадків."
  },
  {
    "name": "Вір мені, я важливий (Звернення до авторитету)",
    "description": "Використання думки відомої особи як доказу, навіть якщо це не стосується теми.",
    "example": "Знаменитість сказала, що цей вітамін працює, отже, це правда.",
    "correctedExample": "Треба звертатися до медичних досліджень, а не до думки знаменитостей.",
    "explanation": "Відомість не робить людину правою у всіх питаннях."
  },
  {
    "name": "Це сталося, отже, це причина (Post Hoc)",
    "description": "Припущення, що якщо щось сталося перед іншим, то це стало причиною.",
    "example": "Я одягнув щасливі шкарпетки і ми виграли гру, отже, це завдяки шкарпеткам.",
    "correctedExample": "Перемога, ймовірно, була завдяки майстерності, а не шкарпеткам.",
    "explanation": "Часова послідовність не доводить причинності."
  },
  {
    "name": "Замість аргументів — емоції (Звернення до емоцій)",
    "description": "Спроба виграти суперечку, викликаючи емоції замість логіки.",
    "example": "Подумайте про дітей — треба заборонити всі відеоігри!",
    "correctedExample": "Треба розглянути дані про відеоігри та поведінку, а не лише емоції.",
    "explanation": "Емоції підміняють логічні аргументи."
  },
  {
    "name": "Зміна теми (Червоний оселедець)",
    "description": "Відволікання від основної теми за допомогою несуттєвої інформації.",
    "example": "Навіщо турбуватися про забруднення, якщо безробіття ще високе?",
    "correctedExample": "Забруднення та безробіття важливі, але їх треба обговорювати окремо.",
    "explanation": "Відволікає увагу від початкової теми."
  },
  {
    "name": "Всі так роблять (Ефект натовпу)",
    "description": "Ствердження, що щось правильно, бо так роблять інші.",
    "example": "Всі користуються цим додатком, отже, він найкращий.",
    "correctedExample": "Треба звернути увагу на функції та відгуки, а не лише на популярність.",
    "explanation": "Слідування за натовпом не гарантує якості."
  },
  {
    "name": "Це не одне й те саме (Хибна еквівалентність)",
    "description": "Сприйняття двох дуже різних речей як рівних.",
    "example": "Навіщо забороняти куріння? Кофеїн — це теж наркотик.",
    "correctedExample": "Куріння і кофеїн мають різний вплив на здоров'я та регулювання.",
    "explanation": "Порівнюються речі, які насправді не рівні."
  },
  {
    "name": "Доведи, що я не правий (Тягар доказу)",
    "description": "Висування твердження і вимога, щоб інші його спростували.",
    "example": "Інопланетяни існують, якщо ти не можеш довести зворотне.",
    "correctedExample": "Надзвичайні твердження потребують доказів. Доказ має надавати той, хто стверджує.",
    "explanation": "Несправедливо перекладає відповідальність."
  },
  {
    "name": "Зміна визначення (Жоден справжній шотландець)",
    "description": "Зміна правил, щоб ігнорувати докази, які суперечать твердженню.",
    "example": "Жоден справжній патріот не критикуватиме свою країну.",
    "correctedExample": "Можна любити свою країну і водночас її критикувати.",
    "explanation": "Змінюються критерії, щоб захистити твердження."
  },
  {
    "name": "Повторення твердження (Кругова аргументація)",
    "description": "Повторення одного й того ж різними словами замість доказу.",
    "example": "Брехати погано, бо це аморально.",
    "correctedExample": "Треба пояснити, чому брехня аморальна, а не просто повторювати твердження.",
    "explanation": "Висновок повторюється як причина."
  },
  {
    "name": "Підступне питання (Навідне питання)",
    "description": "Питання, яке містить несправедливе або неправдиве припущення.",
    "example": "Чому ти так погано керуєш своїм часом?",
    "correctedExample": "Які труднощі ти маєш з тайм-менеджментом?",
    "explanation": "Питання припускає невдачу без доказів."
  },
  {
    "name": "Природне — краще (Звернення до природи)",
    "description": "Ствердження, що щось добре лише тому, що воно природне.",
    "example": "Ці ліки натуральні, отже, вони безпечні.",
    "correctedExample": "Природні речовини теж можуть бути шкідливими. Безпеку треба перевіряти.",
    "explanation": "Природне не завжди означає краще."
  },
  {
    "name": "Ти теж так робиш (Tu Quoque)",
    "description": "Відхилення критики через звинувачення іншого у тому ж самому.",
    "example": "Ти кажеш мені їсти здорову їжу, але я бачив, як ти їв чипси вчора!",
    "correctedExample": "Навіть якщо я їв чипси, здорова їжа все одно корисна.",
    "explanation": "Проблема ігнорується через напад на співрозмовника."
  },
  {
    "name": "Давайте знайдемо середину (Золота середина)",
    "description": "Ствердження, що компроміс між двома сторонами завжди правильний.",
    "example": "Один каже, що Земля плоска, інший — що кругла. Можливо, вона овальна.",
    "correctedExample": "Треба спиратися на докази, а не шукати компроміс між правдою і помилкою.",
    "explanation": "Істина не завжди посередині."
  }
]
