[
  {
    "name": "Attacking the Person (Ad Hominem)",
    "description": "Rejecting an idea by criticizing the person instead of the idea.",
    "example": "You can't trust Maria's opinion on climate change—she failed science in high school.",
    "correctedExample": "Maria's past grades aren't relevant. Let's look at the data she presents on climate change.",
    "explanation": "The argument dismisses Maria's point based on her personal history, not the actual topic."
  },
  {
    "name": "Misrepresenting the Argument (Strawman)",
    "description": "Changing someone's argument to make it easier to attack.",
    "example": "John says we should be more careful with military spending. Sarah replies, 'John wants to leave us defenseless!'",
    "correctedExample": "John is suggesting caution, not eliminating the military. We should address his actual point.",
    "explanation": "Sarah distorts John's view into something extreme and unrelated."
  },
  {
    "name": "It’s True Because It’s Popular (Appeal to Popularity)",
    "description": "Claiming something is true just because many people believe it.",
    "example": "Everyone says this new diet works, so it must be effective.",
    "correctedExample": "We should check if there's scientific evidence that the diet works.",
    "explanation": "Popularity doesn't prove something is true."
  },
  {
    "name": "Only Two Choices (False Dilemma)",
    "description": "Saying there are only two options when more actually exist.",
    "example": "You're either with us or against us.",
    "correctedExample": "Someone can support some ideas without agreeing with everything.",
    "explanation": "This oversimplifies complex positions into two extremes."
  },
  {
    "name": "Going in Circles (Begging the Question)",
    "description": "Repeating the conclusion as the reason, without offering evidence.",
    "example": "The law is just because it's the law.",
    "correctedExample": "We should explain why the law is fair or beneficial.",
    "explanation": "It assumes what it’s trying to prove."
  },
  {
    "name": "If This, Then Disaster (Slippery Slope)",
    "description": "Saying a small step will lead to something extreme without proof.",
    "example": "If we allow students to redo assignments, soon they’ll expect to retake every test too.",
    "correctedExample": "Redoing some assignments doesn’t mean all rules will disappear. Let’s focus on the policy itself.",
    "explanation": "It jumps from a small change to an exaggerated outcome."
  },
  {
    "name": "Jumping to Conclusions (Hasty Generalization)",
    "description": "Making a broad claim based on little evidence.",
    "example": "I met two rude people from that city—everyone there must be rude.",
    "correctedExample": "Two people aren’t enough to judge an entire city.",
    "explanation": "It assumes a general rule based on a few cases."
  },
  {
    "name": "Trust Me, I’m Important (Appeal to Authority)",
    "description": "Using a famous person’s opinion as proof, even when it’s not relevant.",
    "example": "A celebrity said this vitamin works, so it must be true.",
    "correctedExample": "We should look for medical studies, not celebrity opinions.",
    "explanation": "Being famous doesn’t make someone right on every topic."
  },
  {
    "name": "This Happened, So That Must’ve Caused It (Post Hoc)",
    "description": "Assuming that just because one thing happened before another, it caused it.",
    "example": "I wore my lucky socks and we won the game, so the socks caused it.",
    "correctedExample": "Winning was probably due to skill, not socks.",
    "explanation": "Timing doesn’t prove cause."
  },
  {
    "name": "Using Feelings Instead of Reasons (Appeal to Emotion)",
    "description": "Trying to win an argument by stirring emotions instead of logic.",
    "example": "Think of the children—we must ban all video games!",
    "correctedExample": "Let’s look at data on video games and behavior, not just emotional reactions.",
    "explanation": "It replaces reasoning with emotional pressure."
  },
  {
    "name": "Changing the Subject (Red Herring)",
    "description": "Distracting from the main point with unrelated information.",
    "example": "Why worry about pollution when unemployment is still high?",
    "correctedExample": "Pollution and unemployment are both important but should be discussed separately.",
    "explanation": "It diverts attention from the original topic."
  },
  {
    "name": "Everyone’s Doing It (Bandwagon)",
    "description": "Arguing something is right because other people are doing it.",
    "example": "Everyone’s using this app, so it must be the best.",
    "correctedExample": "Let’s look at the features and reviews, not just popularity.",
    "explanation": "Following the crowd doesn’t guarantee quality."
  },
  {
    "name": "Not the Same Thing (False Equivalence)",
    "description": "Treating two very different things as if they’re equal.",
    "example": "Why ban smoking? Caffeine is a drug too.",
    "correctedExample": "Smoking and caffeine have different health impacts and regulations.",
    "explanation": "It compares things that aren’t truly equal."
  },
  {
    "name": "Prove Me Wrong (Burden of Proof)",
    "description": "Making a claim and saying others must disprove it.",
    "example": "Aliens exist unless you can prove they don't.",
    "correctedExample": "Extraordinary claims need evidence. The person making the claim should support it.",
    "explanation": "Shifts responsibility unfairly."
  },
  {
    "name": "Shifting the Definition (No True Scotsman)",
    "description": "Changing the rules to ignore evidence that goes against your claim.",
    "example": "No true patriot would criticize their country.",
    "correctedExample": "People can love their country and still criticize it.",
    "explanation": "It moves the goalposts to protect the claim."
  },
  {
    "name": "Repeating the Claim (Circular Reasoning)",
    "description": "Saying the same thing in different words instead of proving it.",
    "example": "Lying is wrong because it's immoral.",
    "correctedExample": "We should explain why lying is immoral, not just restate the claim.",
    "explanation": "It repeats the conclusion as its reason."
  },
  {
    "name": "Trick Question (Loaded Question)",
    "description": "Asking something that assumes something untrue or unfair.",
    "example": "Why are you so bad at managing your time?",
    "correctedExample": "What challenges are you facing with time management?",
    "explanation": "The question assumes failure without evidence."
  },
  {
    "name": "Natural Is Better (Appeal to Nature)",
    "description": "Saying something is good just because it’s natural.",
    "example": "This medicine is natural, so it must be safe.",
    "correctedExample": "Natural things can still be harmful. Safety needs testing.",
    "explanation": "Natural doesn’t always mean better."
  },
  {
    "name": "You Do It Too (Tu Quoque)",
    "description": "Dismissing criticism by accusing the other person of the same thing.",
    "example": "You tell me to eat healthy, but I saw you eat chips yesterday!",
    "correctedExample": "Even if I ate chips, healthy eating is still a good idea.",
    "explanation": "It avoids the issue by attacking the messenger."
  },
  {
    "name": "Let’s Just Meet in the Middle (Middle Ground)",
    "description": "Saying the compromise between two sides must be right.",
    "example": "One person says the Earth is flat, another says it’s round. So maybe it’s oval.",
    "correctedExample": "We need to rely on evidence, not compromise between truth and error.",
    "explanation": "Truth isn’t always in the middle."
  }
]
