[
  {
    "text": "Якщо дозволити людям їсти шоколад щодня, незабаром всі будуть їсти лише шоколад і стануть нездоровими.",
    "fallacy_type": "Слизький схил",
    "explanation": "Цей аргумент без доказів припускає, що незначна дія неминуче призведе до крайніх наслідків.",
    "corrected": "Дозвіл їсти шоколад щодня не означає, що люди перестануть їсти іншу їжу чи стануть нездоровими, адже можлива поміркованість і збалансоване харчування."
  },
  {
    "text": "Не можна довіряти нічому, що каже Іван про зміну клімату, бо він не науковець.",
    "fallacy_type": "Ad Hominem",
    "explanation": "Це напад на особу замість розгляду аргументу чи доказів.",
    "corrected": "Незалежно від професії Івана, його аргументи щодо зміни клімату слід оцінювати за суттю та доказами."
  },
  {
    "text": "Або ми забороняємо всі автомобілі в місті, або забруднення ніколи не зменшиться.",
    "fallacy_type": "Хибна дилема",
    "explanation": "Це подання лише двох варіантів, коли існує більше можливостей.",
    "corrected": "Є багато способів зменшити забруднення в місті, наприклад, покращення транспорту чи стимулювання електромобілів, а не лише заборона авто."
  },
  {
    "text": "Всі мої знайомі купують новий телефон, отже, це найкращий телефон.",
    "fallacy_type": "Ефект більшості",
    "explanation": "Це припущення, що щось є найкращим лише через популярність.",
    "corrected": "Популярність не завжди означає якість; найкращий телефон слід визначати за характеристиками та продуктивністю."
  },
  {
    "text": "Якщо ти не підтримуєш цей новий закон, значить тобі байдуже на громадську безпеку.",
    "fallacy_type": "Солом'яний опудало",
    "explanation": "Це спотворення позиції опонента, щоб легше її спростувати.",
    "corrected": "Людина може не підтримувати закон з різних причин і водночас турбуватися про безпеку."
  },
  {
    "text": "Мій дідусь курив щодня і прожив до 90 років, отже, куріння не таке вже й шкідливе.",
    "fallacy_type": "Анеґдотичний доказ",
    "explanation": "Це використання особистої історії замість наукових доказів.",
    "corrected": "Деякі люди можуть жити довго, навіть курячи, але дослідження показують, що куріння підвищує ризики для здоров'я."
  },
  {
    "text": "Не варто слухати її аргументи про переробку, бо її бачили, як вона смітить.",
    "fallacy_type": "Tu Quoque",
    "explanation": "Це відхилення аргументу через вказування на лицемірство, а не розгляд суті.",
    "corrected": "Особисті дії не скасовують змісту її аргументів про переробку."
  },
  {
    "text": "Ніхто не довів, що інопланетян не існує, отже, вони реальні.",
    "fallacy_type": "Звернення до незнання",
    "explanation": "Це твердження, що щось істинне, бо не доведено протилежного.",
    "corrected": "Відсутність доказів проти існування інопланетян не доводить їх існування."
  },
  {
    "text": "Коти кращі домашні тварини, бо всі знають, що коти кращі.",
    "fallacy_type": "Питання, що випереджає відповідь",
    "explanation": "Аргумент містить висновок у своїй передумові.",
    "corrected": "Щоб довести, що коти кращі, слід навести причини, наприклад, їхню незалежність чи охайність."
  },
  {
    "text": "Якщо дозволити студентам переробити одне завдання, вони захочуть переробляти всі тести й проекти.",
    "fallacy_type": "Слизький схил",
    "explanation": "Це припущення, що незначна дія призведе до низки негативних подій без підстав.",
    "corrected": "Дозвіл переробити одне завдання не означає, що студенти вимагатимуть переробки всіх робіт; чіткі правила можуть цьому запобігти."
  }
]
